![title](img/cover4.png)

<center><em>Copyright! This material is protected, please do not copy or distribute.    by:Taher Assaf</em></center>

***
<h1 align="center">Udemy course : Python Bootcamp for Data Science 2021 Numpy Pandas & Seaborn</h1> 

***

## 9.7 Filtering Outliers

First we import numoy and pandas libraries:

In [1]:
import numpy as np
import pandas as pd

Here we read a dataframe from a csv file using the function **pd.read_csv()**:

In [2]:
data = pd.read_csv('data/ex2.csv')
data.head(15)

     Income  Rating  Cards  Age
0    19.225     122      3   38
1    43.540     232      4   69
2   152.298     828      4   41
3    55.367     448      1   33
4    11.741     182     44   59
5    15.560     352      4   57
6    59.530     543      3   52
7    20.191     431      4   42
8    48.498     456      3   47
9    30.733     249      4   51
10   16.479     388      2   26
11   38.009     245      3   45
12   14.084     120     55   46
13   14.312     367      1   59
14   26.067     266      4   74

We can use the function **describe()** to display the common statistics for this dataframe:

In [3]:
data.describe()

           Income      Rating      Cards       Age
count   20.000000   20.000000  20.000000  20.00000
mean    39.681100  352.700000   7.600000  51.05000
std     33.482958  179.936568  14.485565  12.94716
min     11.741000  120.000000   1.000000  26.00000
25%     17.601750  238.750000   2.000000  41.75000
50%     28.400000  309.000000   3.000000  49.00000
75%     50.215250  450.000000   4.000000  59.00000
max    152.298000  828.000000  55.000000  74.00000

We can filter values in the Cards column taht are greater than five using boolean mask:

In [4]:
data[data.Cards> 5]

    Income  Rating  Cards  Age
4   11.741     182     44   59
12  14.084     120     55   46

Here ewe can change the values of these outliers using the function **loc[ ]**:

In [5]:
data.loc[4,['Cards']] = 4
data.loc[12,['Cards']] = 5

Here we check for outliers ( cards > 5) using boolean expression:

In [6]:
(data.Cards > 5)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
Name: Cards, dtype: bool

Or much easier, we can add the function **any()** to return a single boolean value:

In [7]:
(data.Cards > 5).any()

False

Lets read the data frame again:

In [8]:
data = pd.read_csv('data/ex2.csv')

Alternatively, we can replace outliers with missing values (NaN):

In [9]:
data.loc[4,['Cards']] = np.nan
data.loc[12,['Cards']] = np.nan

In [10]:
data.head(15)

     Income  Rating  Cards  Age
0    19.225     122    3.0   38
1    43.540     232    4.0   69
2   152.298     828    4.0   41
3    55.367     448    1.0   33
4    11.741     182    NaN   59
5    15.560     352    4.0   57
6    59.530     543    3.0   52
7    20.191     431    4.0   42
8    48.498     456    3.0   47
9    30.733     249    4.0   51
10   16.479     388    2.0   26
11   38.009     245    3.0   45
12   14.084     120    NaN   46
13   14.312     367    1.0   59
14   26.067     266    4.0   74

***

<h1 align="center">Thank You</h1> 

***